using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace ServerApp.Migrations
{
    /// <inheritdoc />
    public partial class InsertPeopleMigration : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            var command = @"exec sp_osoba_insert 'Ненад','Ненадовић','1998-04-23','23049983945673','+381(64)3940583',3,1;
                            exec sp_osoba_insert 'Милица','Милићевић','1997-07-14','14079974950493','+381(64)1532475',2,1;
                            exec sp_osoba_insert 'Марко','Ненадовић','1993-05-24','24059933948392','+381(64)1532475',3,2;
                            exec sp_osoba_insert 'Недељко','Стевановић','1980-10-23','23109804059320','+381(64)2346732',4,5;
                            exec sp_osoba_insert 'Станко','Стаменковић','1985-05-29','29059854839282','+381(64)2930293',4,0;
                            exec sp_osoba_insert 'Виктор','Смиљанић','1984-09-15','15099842948574','+381(64)3940384',3,5;
                            exec sp_osoba_insert 'Милица','Миљковић','1963-02-22','22029632930482','+381(64)0495385',1,4;
                            exec sp_osoba_insert 'Милоје','Јовичић','1992-11-07','07119923030485','+381(64)1532475',2,1;
                            exec sp_osoba_insert 'Филип','Филиповић','1970-03-12','1203970392847','+381(66)2937363',1,3;
                            exec sp_osoba_insert 'Немања','Милошевић','1977-02-18','18029772738292','+381(69)3388447',2,0;
                            exec sp_osoba_insert 'Милош','Миленковић','1967-11-09','09119673030485','+381(64)3857463',3,5;
                            exec sp_osoba_insert 'Стефан','Станишић','1995-10-20','20109954958473','+381(64)3926193',1,1;
                            exec sp_osoba_insert 'Марко','Величковић','1981-01-07','0701981385749','+381(63)4848433',1,5;
                            exec sp_osoba_insert 'Кристијан','Маричић','1982-03-27','27039823849503','+381(62)3399440',1,3;
                            exec sp_osoba_insert 'Ненад','Јанковић','1957-09-07','0709957373837','+381(66)2281189',2,0;
                            exec sp_osoba_insert 'Милорад','Недељковић','1960-11-07','07119603829389','+381(62)1237892',4,3;
                            exec sp_osoba_insert 'Страхиња','Милојевић','1975-04-10','1004975384950','+381(68)3940573',4,4;
                            exec sp_osoba_insert 'Милан','Антић','1980-06-02','02069803829021','+381(69)3029472',5,5;
                            exec sp_osoba_insert 'Милоје','Јовичић','1992-11-07','3223902837393','+381(64)1532475',6,6;
                            exec sp_osoba_insert 'Небојша','Николић','1992-11-07','3920274028292','+381(64)1532475',6,6;";
            migrationBuilder.Sql(command);
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {

        }
    }
}
